NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D33.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SFR</name>
      <version>11066A</version>
      <description>Special Function Registers</description>
      <prependToName>SFR_</prependToName>
      <baseAddress>0xF0038000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OHCIICR</name>
          <description>OHCI Interrupt Configuration Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RES0</name>
              <description>USB PORTx RESET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES1</name>
              <description>USB PORTx RESET</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RES2</name>
              <description>USB PORTx RESET</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARIE</name>
              <description>OHCI Asynchronous Resume Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APPSTART</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UDPPUDIS</name>
              <description>OHCI USB DEVICE PULL-UP DISABLE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OHCIISR</name>
          <description>OHCI Interrupt Status Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RIS0</name>
              <description>OHCI Resume Interrupt Status Port 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIS1</name>
              <description>OHCI Resume Interrupt Status Port 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIS2</name>
              <description>OHCI Resume Interrupt Status Port 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB</name>
          <description>AHB Configuration Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PFETCH10</name>
              <description>AHB MASTERx 10 Converter Prefetch</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>INCR undefined burst converted to burst of 4 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>INCR undefined burst converted to burst of 8 beats.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFETCH11</name>
              <description>AHB MASTERx 11 Converter Prefetch</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>INCR undefined burst converted to burst of 4 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>INCR undefined burst converted to burst of 8 beats.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFETCH12</name>
              <description>AHB MASTERx 12 Converter Prefetch</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>INCR undefined burst converted to burst of 4 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>INCR undefined burst converted to burst of 8 beats.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFETCH13</name>
              <description>AHB MASTERx 13 Converter Prefetch</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>INCR undefined burst converted to burst of 4 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>INCR undefined burst converted to burst of 8 beats.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFETCH14</name>
              <description>AHB MASTERx 14 Converter Prefetch</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCR4</name>
                  <description>INCR undefined burst converted to burst of 4 beats.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCR8</name>
                  <description>INCR undefined burst converted to burst of 8 beats.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLBOPT10</name>
              <description>AHB MASTERx 10 Converter Define Length Burst Optimization</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLBOPT11</name>
              <description>AHB MASTERx 11 Converter Define Length Burst Optimization</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLBOPT12</name>
              <description>AHB MASTERx 12 Converter Define Length Burst Optimization</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLBOPT13</name>
              <description>AHB MASTERx 13 Converter Define Length Burst Optimization</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLBOPT14</name>
              <description>AHB MASTERx 14 Converter Define Length Burst Optimization</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRIDGE</name>
          <description>Bridge Configuration Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APBTURBO</name>
              <description>AHB to APB Bridge mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI2AHBSEL</name>
              <description>AXI to AHB bridge for DDR controller selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>use single port bridge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL</name>
                  <description>use dual port bridge.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURE</name>
          <description>Security Configuration Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROM</name>
              <description>Disable Access to ROM Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUSE</name>
              <description>Disable Access to Fuse Controller</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTMICKTRIM</name>
          <description>UTMI Clock Trimming Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>FREQ</name>
              <description>UTMI Reference Clock Frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>12</name>
                  <description>12 MHz reference clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 MHz reference clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24 MHz reference clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48</name>
                  <description>48 MHz reference clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBG</name>
              <description>UTMI Band Gap Voltage Trimming</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTMIHSTRIM</name>
          <description>UTMI High Speed Trimming Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00044433</resetValue>
          <fields>
            <field>
              <name>SQUELCH</name>
              <description>UTMI HS SQUELCH Voltage Trimming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISC</name>
              <description>UTMI Disconnect Voltage Trimming</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOPE0</name>
              <description>UTMI HS PORTx Transceiver Slope Trimming</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOPE1</name>
              <description>UTMI HS PORTx Transceiver Slope Trimming</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLOPE2</name>
              <description>UTMI HS PORTx Transceiver Slope Trimming</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTMIFSTRIM</name>
          <description>UTMI Full Speed Trimming Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00430211</resetValue>
          <fields>
            <field>
              <name>RISE</name>
              <description>FS Transceiver output rising slope trimming</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FALL</name>
              <description>FS Transceiver output falling slope trimming</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVR</name>
              <description>FS Transceiver crossover voltage trimming</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZN</name>
              <description>FS Transceiver NMOS impedance trimming</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZP</name>
              <description>FS Transceiver PMOS impedance trimming</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UTMISWAP</name>
          <description>UTMI DP/DM Pin Swapping Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT0</name>
              <description>PORT 0 DP/DM Pin Swapping</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>DP/DM normal pinout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAPPED</name>
                  <description>DP/DM swapped pinout.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT1</name>
              <description>PORT 1 DP/DM Pin Swapping</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>DP/DM normal pinout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAPPED</name>
                  <description>DP/DM swapped pinout.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PORT2</name>
              <description>PORT 2 DP/DM Pin Swapping</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>DP/DM normal pinout.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAPPED</name>
                  <description>DP/DM swapped pinout.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
