NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAMA5D33.svd
        <register>
          <name>TSMR</name>
          <description>Touchscreen Mode Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSMODE</name>
              <description>Touchscreen Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Touchscreen</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_WIRE_NO_PM</name>
                  <description>4-wire Touchscreen without pressure measurement</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_WIRE</name>
                  <description>4-wire Touchscreen with pressure measurement</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_WIRE</name>
                  <description>5-wire Touchscreen</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAV</name>
              <description>Touchscreen Average</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FILTER</name>
                  <description>No Filtering. Only one ADC conversion per measure</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG2CONV</name>
                  <description>Averages 2 ADC conversions</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG4CONV</name>
                  <description>Averages 4 ADC conversions</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG8CONV</name>
                  <description>Averages 8 ADC conversions</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSFREQ</name>
              <description>Touchscreen Frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSSCTIM</name>
              <description>Touchscreen Switches Closure Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NOTSDMA</name>
              <description>No TouchScreen DMA</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDET</name>
              <description>Pen Contact Detection Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PENDBC</name>
              <description>Pen Detect Debouncing Period</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XPOSR</name>
          <description>Touchscreen X Position Register</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XPOS</name>
              <description>X Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XSCALE</name>
              <description>Scale of XPOS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>YPOSR</name>
          <description>Touchscreen Y Position Register</description>
          <addressOffset>0x000000B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YPOS</name>
              <description>Y Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>YSCALE</name>
              <description>Scale of YPOS</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESSR</name>
          <description>Touchscreen Pressure Register</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Z1</name>
              <description>Data of Z1 Measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Z2</name>
              <description>Data of Z2 Measurement</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGR</name>
          <description>Trigger Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRGMOD</name>
              <description>Trigger Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TRIGGER</name>
                  <description>No trigger, only software trigger can start conversions</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TRIG_RISE</name>
                  <description>External Trigger Rising Edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TRIG_FALL</name>
                  <description>External Trigger Falling Edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_TRIG_ANY</name>
                  <description>External Trigger Any Edge</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEN_TRIG</name>
                  <description>Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIOD_TRIG</name>
                  <description>Periodic Trigger (TRGPER shall be initiated appropriately)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous Mode</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPER</name>
              <description>Trigger Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>Write Protect Mode Register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protect KEY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>Write Protect Status Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protect Violation Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protect Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
